<?php
/**
 * SmartSystem v.4
 *
 * @package smartsystem
 */

/**
 * Klasa statyczna obslugjaca rozne operacje na łancuchach
 *
 */
class String {
	
	/**
	 * Zamienia nie dozwolone znaki (polskie znaki diakrytyczne ) oraz spacje
	 *
	 * @param unknown_type $string
	 */
	public static function toModerewrite($string, $is_file_name=false) {

		$string = preg_replace("`\[.*\]`U","",$string);
	  	
		if(!$is_file_name){
			$replace_array = array('Ą'=>'A','ą'=>'a','Ż'=>'Z','ż'=>'z','Ź'=>'Z','ź'=>'z','Ć'=>'C','ć'=>'c','Ń'=>'N','ń'=>'n','Ł'=>'L','ł'=>'l','Ś'=>'S','ś'=>'s','Ę'=>'E','ę'=>'e','Ó'=>'O','ó'=>'o', ' '=>'_',','=>'','.'=>'',':'=>'','&amp;'=>'&','&nbsp;'=>'_',';'=>'','?'=>'','/'=>'','\''=>'','\''=>'','`'=>'','"'=>'','%'=>'','@'=>'','!'=>'','#'=>'','$'=>'','^'=>'','&'=>'','*'=>'','+'=>'','|'=>'','['=>'',']'=>'','{'=>'','}'=>'','('=>'',')'=>'','='=>'','<'=>'','>'=>'','-'=>'_','Á'=>'A','á'=>'a','Å'=>'A','å'=>'a','ů'=>'u','Ů'=>'U','ú'=>'u','Ú'=>'U','č'=>'c','Č'=>'C','ý'=>'y','Ý'=>'Y','š'=>'s','Š'=>'S','ž'=>'z','Ž'=>'Z','ř'=>'r','Ř'=>'R','ä'=>'ae','Ä'=>'Ae','ö'=>'oe','Ö'=>'Oe','ü'=>'ue','Ü'=>'Ue','β'=>'ss','ő'=>'o','é'=>'e','í'=>'i','а'=>'a','б'=>'b','в'=>'v','г'=>'g','д'=>'d','е'=>'e','ж'=>'j','з'=>'z','и'=>'i','й'=>'y','к'=>'k','л'=>'l','м'=>'m','н'=>'n','о'=>'o','п'=>'p','р'=>'r','с'=>'s','т'=>'t','у'=>'u','ф'=>'f','х'=>'h','ц'=>'c','ч'=>'ch','ш'=>'sh','щ'=>'sht','ъ'=>'a','ь'=>'x','ю'=>'yu','я'=>'ya','А'=>'A','Б'=>'B','В'=>'V','Г'=>'G','Д'=>'D','Е'=>'E','Ж'=>'J','З'=>'Z','И'=>'I','Й'=>'Y','К'=>'K','Л'=>'L','М'=>'M','Н'=>'N','О'=>'O','П'=>'P','Р'=>'R','С'=>'S','Т'=>'T','У'=>'U','Ф'=>'F','Х'=>'H','Ц'=>'C','Ч'=>'CH','Ш'=>'SH','Щ'=>'SHT','Ъ'=>'A','Ь'=>'X','Ю'=>'YU','Я'=>'YA');
		}else{
			$replace_array = array('Ą'=>'A','ą'=>'a','Ż'=>'Z','ż'=>'z','Ź'=>'Z','ź'=>'z','Ć'=>'C','ć'=>'c','Ń'=>'N','ń'=>'n','Ł'=>'L','ł'=>'l','Ś'=>'S','ś'=>'s','Ę'=>'E','ę'=>'e','Ó'=>'O','ó'=>'o', ' '=>'_',','=>'',':'=>'','&amp;'=>'&','&nbsp;'=>'_',';'=>'','?'=>'','/'=>'','\''=>'','\''=>'','`'=>'','"'=>'','%'=>'','@'=>'','!'=>'','#'=>'','$'=>'','^'=>'','&'=>'','*'=>'','+'=>'','|'=>'','['=>'',']'=>'','{'=>'','}'=>'','('=>'',')'=>'','='=>'','<'=>'','>'=>'','-'=>'_','Á'=>'A','á'=>'a','Å'=>'A','å'=>'a','ů'=>'u','Ů'=>'U','ú'=>'u','Ú'=>'U','č'=>'c','Č'=>'C','ý'=>'y','Ý'=>'Y','š'=>'s','Š'=>'S','ž'=>'z','Ž'=>'Z','ř'=>'r','Ř'=>'R','ä'=>'ae','Ä'=>'Ae','ö'=>'oe','Ö'=>'Oe','ü'=>'ue','Ü'=>'Ue','β'=>'ss','ő'=>'o','é'=>'e','í'=>'i','а'=>'a','б'=>'b','в'=>'v','г'=>'g','д'=>'d','е'=>'e','ж'=>'j','з'=>'z','и'=>'i','й'=>'y','к'=>'k','л'=>'l','м'=>'m','н'=>'n','о'=>'o','п'=>'p','р'=>'r','с'=>'s','т'=>'t','у'=>'u','ф'=>'f','х'=>'h','ц'=>'c','ч'=>'ch','ш'=>'sh','щ'=>'sht','ъ'=>'a','ь'=>'x','ю'=>'yu','я'=>'ya','А'=>'A','Б'=>'B','В'=>'V','Г'=>'G','Д'=>'D','Е'=>'E','Ж'=>'J','З'=>'Z','И'=>'I','Й'=>'Y','К'=>'K','Л'=>'L','М'=>'M','Н'=>'N','О'=>'O','П'=>'P','Р'=>'R','С'=>'S','Т'=>'T','У'=>'U','Ф'=>'F','Х'=>'H','Ц'=>'C','Ч'=>'CH','Ш'=>'SH','Щ'=>'SHT','Ъ'=>'A','Ь'=>'X','Ю'=>'YU','Я'=>'YA');
		}
		$string = strtr($string, $replace_array);
		
		if(!$is_file_name){
			$pattern = '#^[a-z0-9\-\_]*$#is';
		}else{
			$pattern = '#^[a-z0-9\.\-\_]*$#is';
		}
		
		if( !preg_match($pattern, $string) )
		{
			$length = strlen($string);
			$data = array();
			for ($i=0; $i<$length; $i++)
			{
				$data[$i] = $string[$i];
			}
			foreach($data as $character){
				if( !preg_match($pattern, $character) ){
					$string = str_replace($character,'_',$string);
				}
			}
		}
		return $string;  
	}

	/**
	 * Zmiana stringa na duze znaki
	 *
	 * @param unknown_type $string
	 * @return unknown
	 */
	public static function toUpper($string) {
		$string = strtoupper($string);
		return $string;
	}
	/**
	 * Zmiana stringa na małe znaki
	 *
	 * @param unknown_type $string
	 * @return unknown
	 */
	public static function toLower($string) {
		$string = strtolower($string);
		return $string;
	}

}

?>